Repository: shelllet/languages
Catalog: Strings/*/Resources3.resw
Source language: en_us
Languages: ja_jp, zh_hans_cn, zh_tw

# ResizeImage.Title
source: Adjust the size
ja_jp: 寸法を調整する
zh_hans_cn: 调整尺寸
zh_tw: 調整尺寸

# CenterCropImage.Description
source: Cut the picture from the center position.
ja_jp: 画像を中央からトリミングします。
zh_hans_cn: 从中心位置开始裁切图片。
zh_tw: 從中心位置開始裁切圖片。

# CenterCropImage.Title
source: CenterCropImage
zh_hans_cn: 中心裁切
zh_tw: 中心剪切

# WinRun.Description
source: Opens the run dialog box in the operating system
ja_jp: オペレーティングシステムで[ファイル名を指定して実行]ダイアログボックスを開く
zh_hans_cn: 打开操作系统中的 运行 对话框
zh_tw: 打開作業系統中的運行對話方塊

# WinRun.Title
source: WinRun
zh_hans_cn: 运行框
zh_tw: 運行框

# HttpGet.Description
source: The HTTP GET request method is used to request data-specified resources from the server.
zh_hans_cn: 发送基于 HTTP 的 GET 请求
zh_tw: 用於向服務器請求指定的資源。

# HttpGet.Title
source: HttpGet
zh_hans_cn: GET 请求
zh_tw: GET 請求

# TypeModel.Description
source: Load the onnx, the model file
zh_hans_cn: 加载 ONNX 模型文件
zh_tw: 加載onnx模型檔案

# TypeModel.Title
source: Model
zh_hans_cn: 模型
zh_tw: 模型

# WebWaitVisibilityByElement.Description
source: With known elements to check whether the elements known to exist on the page dom are visible, visibility means that the elements are not only displayed but also the height and width are greater than 0
ja_jp: 「既知のエレメント」では、ページdomに存在することがわかっているエレメントが表示されているかどうかをチェックします。表示されていることは、エレメントが表示されているだけでなく、高さと幅が0より大きいことを意味します
zh_hans_cn: 通过已知元素，检查已知存在于页面 DOM 上的元素是否可见，可见性意味着元素不仅被显示而且高度和宽度都大于 0
zh_tw: 通過已知元素，檢查已知存在於頁面dom上的元素是否可見，可見性意味著元素不僅被顯示而且高度和寬度都大於0

# WebWaitVisibilityByElement.Title
source: Waiting for * visible
ja_jp: 待機*表示
zh_hans_cn: 等待*可见
zh_tw: 等待*可見

# WebWaitAlert.Description
source: Check if the alert currently exists and switch to it.
ja_jp: アラートが現在存在するかどうかを確認し、そのアラートに切り替えます。
zh_hans_cn: 检查当前是否存在警报并切换到它。
zh_tw: 檢查當前是否存在警報並切換到它。

# WebWaitAlert.Title
source: Wait for the * warning box
ja_jp: 待機*警告ボックス
zh_hans_cn: 等待*警告框
zh_tw: 等待*警告框

# WebWaitClickable.Description
source: Use to check that the element is visible and enabled, so that you can click on it.
ja_jp: エレメントが表示され、クリックできるように有効になっていることを確認できます。
zh_hans_cn: 用于检查元素是可见的并已启用，以便您可以单击它。
zh_tw: 用於檢查元素是可見的並已啟用，以便您可以按一下它。

# WebWaitClickable.Title
source: Wait * click
ja_jp: 待機*クリック可能
zh_hans_cn: 等待*可点击
zh_tw: 等待*可點擊

# BlobDetect.Description
source: Blob is an area in an image with different properties (such as brightness, color).
ja_jp: Blobは、周囲の領域とはプロパティ（輝度、カラーなど）が異なる画像の領域です。
zh_hans_cn: 斑点是图像中与周围区域在属性（例如亮度、颜色）上不同的区域， 也可以称为Blob查找。
zh_tw: 斑點是圖像中與周圍區域在屬性（例如亮度、顏色）上不同的區域， 也可以稱為Blob查找。

# BlobDetect.Title
source: BlobDetect
zh_hans_cn: 斑点查找
zh_tw: 斑點查找

# FilterVertex.Description
source: Sen the profile against the shape of the profile
ja_jp: プロファイルの形状に基づいてプロファイルをフィルタする
zh_hans_cn: 根据轮廓的形状筛选轮廓
zh_tw: 根據輪廓的形狀篩選輪廓

# FilterVertex.Title
source: Shape screening
ja_jp: シェイプフィルタ
zh_hans_cn: 形状筛选
zh_tw: 形狀篩選

# CalculateCenter.Description
source: Calculate the rectangular box, or the center position of the outline.
ja_jp: 長方形の枠、または輪郭線の中心位置を計算します。
zh_hans_cn: 计算矩形框，或者轮廓的中心位置。
zh_tw: 計算矩形框，或者輪廓的中心位置。

# CalculateCenter.Title
source: Center coordinates
ja_jp: ちゅうしんざひょう
zh_hans_cn: 中心坐标
zh_tw: 中心座標

# CaptureFullScreen.Description
source: Full screen screenshots
ja_jp: 全画面のスクリーンショット
zh_hans_cn: 全屏截图
zh_tw: 全屏截圖

# CaptureFullScreen.Title
source: Full screen screenshots
ja_jp: 全画面のスクリーンショット
zh_hans_cn: 全屏截图
zh_tw: 全屏截圖

# PositionWindow.Description
source: Changes the position of a child, pop-up, or top-level window.
zh_hans_cn: 更改子窗口、弹出窗口或顶级窗口为顶层窗口或者非顶层窗口
zh_tw: 更改子窗口、彈出窗口或頂級窗口為頂層窗口或者非頂層窗口

# PositionWindow.Title
source: PositionWindow
zh_hans_cn: 窗口置顶
zh_tw: 窗口置顶

# VideoDownload.Description
source: Download videos
zh_hans_cn: 下载视频,目前只支持 Youtube 视频下载，需要有能访问 Youtube 的网络。
zh_tw: 下载视频，現時只支持youtube視頻下載，需要有能訪問youtube的網絡。

# VideoDownload.Title
source: VideoDownload
zh_hans_cn: 视频下载
zh_tw: 視頻下載

# DirectoryIterator.Description
source: Iterate all files in the local folder
zh_hans_cn: 遍历本地文件夹当中的所有文件
zh_tw: 遍曆本地文件夾當中的所有文件

# DirectoryIterator.Title
source: DirectoryIterator
zh_hans_cn: 遍历文件
zh_tw: 遍歷文件

# CopyFile.Description
source: Copy the file from one position to another.
zh_hans_cn: 把文件从一个位置复制到另一个位置。
zh_tw: 把檔案從一個位置複製到另一個位置。

# CopyFile.Title
source: CopyFile
zh_hans_cn: 文件复制
zh_tw: 檔案複製

# CodeExpression.Description
source: This action can execute an expression of the python.
ja_jp: このアクションはpythonの式を実行します。
zh_hans_cn: 此动作可以执行 Python 的表达式。
zh_tw: 此動作可以執行python的運算式。

# CodeExpression.Title
source: Representation
ja_jp: 式
zh_hans_cn: 表达式
zh_tw: 運算式

# KillProcess.Description
source: This action can end a process in the operating system
ja_jp: このアクションは、オペレーティングシステムのプロセスを終了します
zh_hans_cn: 该动作可以结束操作系统中的进程
zh_tw: 該動作可以結束作業系統中的行程

# KillProcess.Title
source: Termination process
ja_jp: プロセスの終了
zh_hans_cn: 终止进程
zh_tw: 終止行程

# ActionAlias.Description
source: This action is used to reference the passing actions that can be used in the process.
ja_jp: この動作は、プロセスを参照するために使用されることができる通りすがり動作である。
zh_hans_cn: 此动作是用来引用流程当中，可以被使用的路过动作。
zh_tw: 此動作是用來引用流程當中，可以被使用的路過動作。

# ActionAlias.Title
source: Quote action
ja_jp: 参照アクション
zh_hans_cn: 引用动作
zh_tw: 引用動作

# WindowCaption.Description
source: Get, or set, the window header
zh_hans_cn: 获取或者设置窗口标题
zh_tw: 獲取或者設定視窗標題

# WindowCaption.Title
source: Window title
zh_hans_cn: 窗口标题
zh_tw: 視窗標題

# LineDetection.Description
source: Detect lines in an image
zh_hans_cn: 检测图像中的直线
zh_tw: 檢測圖像中的直線

# LineDetection.Title
source: LineDetection
zh_hans_cn: 直线检测
zh_tw: 直線檢測

# EllipseDetection.Description
source: Detect the circles or ellipses in the image
ja_jp: 画像内の円または楕円の検出
zh_hans_cn: 检测图像中的圆或者椭圆
zh_tw: 檢測影像中的圓或者橢圓

# EllipseDetection.Title
source: Oval detection
ja_jp: 楕円検出
zh_hans_cn: 椭圆检测
zh_tw: 橢圓檢測

# CvtColor.Description
source: The image were color-transformed
ja_jp: 画像の色変換
zh_hans_cn: 对图像进行颜色转换
zh_tw: 對影像進行顏色轉換

# CvtColor.Title
source: Color conversion
ja_jp: カラー変換
zh_hans_cn: 颜色转换
zh_tw: 顏色轉換

# ImageCanny.Description
source: Edge detection
ja_jp: エッジ検出
zh_hans_cn: 边缘检测
zh_tw: 邊緣檢測

# ImageCanny.Title
source: Edge detection
ja_jp: エッジ検出
zh_hans_cn: 边缘检测
zh_tw: 邊緣檢測

# ImageThreshold.Description
source: This action allows for the thresholding operation of the image. in this threshold operation, pixels whose value is greater than the specified threshold are assigned a standard value. this threshold operation is global, that is, the same threshold is used for all pixels in the image.
ja_jp: このアクションは、画像をしきい値化することができる。このしきい値演算では、所定のしきい値よりも大きい値の画素に1つの基準値が割り当てられる。このしきい値操作はグローバルであり、つまり、画像内のすべてのピクセルが同じしきい値を使用します。
zh_hans_cn: 该动作可以对图像进行阈值化操作。在该阈值操作中，值大于指定阈值的像素被分配一个标准值。该阈值操作是全局的，即图像中的所有像素都使用相同的阈值。
zh_tw: 該動作可以對影像進行閾值化操作。 在該閾值操作中，值大於指定閾值的點數被分配一個標準值。 該閾值操作是全域的，即影像中的所有點數都使用相同的閾值。

# ImageThreshold.Title
source: Threshold
ja_jp: しきい値
zh_hans_cn: 阈值操作
zh_tw: 閾值操作

# ImageInRange.Description
source: Specify a color range to retain the color in the color range in the image. Through this method, you can screen the specific color objects in the image.
zh_hans_cn: 指定一个色彩范围，保留图像中符合色彩范围内的颜色，透过这个方式，就可以筛选出图像中的特定颜色物件。
zh_tw: 指定一個色彩範圍，保留圖像中符合色彩範圍內的顏色，透過這個方式，就可以篩選出圖像中的特定顏色物件。

# ImageInRange.Title
source: Color screening
ja_jp: カラーフィルタ
zh_hans_cn: 颜色筛选
zh_tw: 顏色篩選

# MoveDoubleClick.Description
source: Move the mouse and double-click the corresponding mouse to the position
ja_jp: マウスを移動し、マウスの適切なキーをダブルクリックします
zh_hans_cn: 移动鼠标，到达位置后双击鼠标相应的键
zh_tw: 移動滑鼠，到達位置後按兩下滑鼠相應的鍵

# MoveDoubleClick.Title
source: Move and double-click
ja_jp: 移動してダブルクリック
zh_hans_cn: 移动并双击
zh_tw: 移動並按兩下

# ConnectedComponents.Description
source: Connected connectivity analysis of the bolb (spot) region in the binary image allows us to perform a more fine-grained filtering of the spots in the binary image.
ja_jp: 二値画像中のbolb（スポット）領域の連結性を解析することにより、二値画像中のスポットをより細かい粒度でフィルタリングすることができる。
zh_hans_cn: 通过对二值图像中 Bolb（斑点）区域的连通性分析，可以让我们对二值图像中的斑点进行更细粒度的过滤。
zh_tw: 通過對二值圖像中bolb（斑點）區域的連通性分析，可以讓我們對二值圖像中的斑點進行更細粒度的過濾。

# ConnectedComponents.Title
source: Connectivity domain analysis
ja_jp: れんらくたいかいせき
zh_hans_cn: 连通域分析
zh_tw: 連通域分析

# ImageBlur.Description
source: Image blurring
ja_jp: 画像がぼやける
zh_hans_cn: 图像模糊
zh_tw: 影像模糊

# ImageBlur.Title
source: ImageBlur
zh_hans_cn: 平滑/模糊
zh_tw: 平滑/模糊

# FillColor.Description
source: Set a rectangular area on the image, fill in the specified color
zh_hans_cn: 在图像上设置一块矩形区域，填充指定的颜色
zh_tw: 在圖像上設置一塊矩形區域，填充指定的顏色

# FillColor.Title
source: FillColor
zh_hans_cn: 填充颜色
zh_tw: 填充顏色

# FindNonZero.Description
source: On one image, look for non-zero pixel locations.
ja_jp: 画像上で、0以外のピクセル位置を探します。
zh_hans_cn: 在一张图片上，查找非零像素位置。
zh_tw: 在一張圖片上，查找非零點數位置。

# FindNonZero.Title
source: FindNonZero
zh_hans_cn: 非零像素点
zh_tw: 非零點數點

# WorkThread.Description
source: Threading can be used to perform some actions asynchronously.
ja_jp: スレッドを使用して、いくつかのアクションを非同期で実行できます。
zh_hans_cn: 线程可以用于异步执行一些动作。
zh_tw: 線程可以用於非同步執行一些動作。

# WorkThread.Title
source: WorkThread
ja_jp: 作業スレッド
zh_hans_cn: 工作线程
zh_tw: 工作線程

# ActiveWindow.Description
source: Brings the thread that created the specified window into the foreground and activates the window
zh_hans_cn: 将创建指定窗口的线程置于前台并激活该窗口
zh_tw: 将创建指定窗口的线程置于前台并激活该窗口

# ActiveWindow.Title
source: ActiveWindow
zh_hans_cn: 激活窗口
zh_tw: 激活窗口

# WorkTask.Description
source: The action is triggered at a specified time, and the corresponding Sub-process may be performed.
zh_hans_cn: 该动作在指定的时间触发，并且可以执行相应的子流程。
zh_tw: 該動作在指定的時間觸發，並且可以執行相應的子流程。

# WorkTask.Title
source: Timed task
zh_hans_cn: 定时任务
zh_tw: 定時任務

# HttpPost.Description
source: Send the http-based post requests
ja_jp: Httpベースのポスト要求の送信
zh_hans_cn: 发送基于 HTTP 的 POST 请求
zh_tw: 發送基於 HTTP 的 POST 請求

# HttpPost.Title
source: HttpPost
zh_hans_cn: POST 请求
zh_tw: POST 請求

# HttpHead.Description
source: The HTTP HEAD method requests HTTP headers from the server.
zh_hans_cn: 用于向服务器请求指定的资源。
zh_tw: 使用 HTTP HEAD 方法從服務器請求HTTP 標頭。

# HttpHead.Title
source: HttpHead
zh_hans_cn: HEAD 请求
zh_tw: HEAD 請求

# Android.Description
source: Android
ja_jp: アンドロイド
zh_hans_cn: 基于 ADB 的安卓操作
zh_tw: 安卓

# Android.Title
source: Android
ja_jp: アンドロイド
zh_hans_cn: 安卓
zh_tw: 安卓

# AdbKillServer.Description
source: Terminate the adb server process.
zh_hans_cn: 终止 adb 服务进程。
zh_tw: 終止 adb 服務進程。

# AdbKillServer.Title
source: AdbKillServer
zh_hans_cn: 终止服务
zh_tw: 終止服務

# AdbDevices.Description
source: Query the android simulator that is already started in the system.
ja_jp: システムで起動しているandroidエミュレータを確認します。
zh_hans_cn: 查询系统中已经启动的安卓模拟器。
zh_tw: 查詢系統中已經啟動的安卓模擬器。

# AdbDevices.Title
source: AdbDevices
zh_hans_cn: 设备
zh_tw: 裝置

# AdbStartServer.Description
source: Starts the adb server if it is not running.
zh_hans_cn: 如果 *adb*服务未启动，启动 adb 服务。
zh_tw: 如果 *adb*服務未啟動，啟動 adb 服務。

# AdbStartServer.Title
source: AdbStartServer
zh_hans_cn: 启动服务
zh_tw: 啟動服務

# AdbForward.Description
source: Map your android port to your local port.
ja_jp: アンドロイドのポートをローカルポートにマッピングします。
zh_hans_cn: 把安卓系统的端口映射到本地端口。
zh_tw: 把安卓系統的埠映射到本地埠。

# AdbForward.Title
source: AdbForward
zh_hans_cn: 转发
zh_tw: 轉發

# AdbConnect.Description
source: Connect the simulator, mainly used in the simulator on the remote computer above.
ja_jp: 接続シミュレータは、主にシミュレータが遠隔地にあるコンピュータ上で利用される。
zh_hans_cn: 连接模拟器，主要应用在模拟器在远程电脑上面。
zh_tw: 連接模擬器，主要應用在模擬器在遠程電腦上面。

# AdbConnect.Title
source: AdbConnect
zh_hans_cn: 连接
zh_tw: 連接

# AdbPush.Description
source: Copy local files/directories to Android device
zh_hans_cn: 将本地文件/目录复制到 `Android` 设备。
zh_tw: 將本地文件/目錄複製到 `Android` 設備。

# AdbPush.Title
source: AdbPush
zh_hans_cn: 上传文件
zh_tw: 上傳文件

# Adbkeyboard.Description
source: Send text input to android device, you must install 'ADBKeyBoard'，this action support chinese characters。
zh_hans_cn: 发送键盘输入至 Android 设备，必须安装 `Adbkeyboard`，可支持中文输入。
zh_tw: 發送鍵盤輸入至 Android 設備，必須安裝‘Adbkeyboard’，可支持中文輸入。

# Adbkeyboard.Title
source: Adbkeyboard
zh_hans_cn: 键盘输入
zh_tw: 鍵盤輸入

# ReadLines.Description
source: Read the text file, and disassemble the multi-line string according to the changing character's `\r\n`, which is a list of string.
zh_hans_cn: 读取文本文件，并根据换行符 `\r\n`，拆分成多行字符串，也就是字符串列表。
zh_tw: 讀取文本文件，並根據換行符 `\r\n`，拆分成多行字符串，也就是字符串列表。

# ReadLines.Title
source: ReadLines
zh_hans_cn: 按行读取
zh_tw: 按行讀取

# AdbSwipe.Description
source: Slide the operation in the android simulator.
ja_jp: アンドロイドエミュレータではスワイプ操作を実現している。
zh_hans_cn: 在安卓模拟器当中实现滑动操作。
zh_tw: 在安卓模擬器當中實現滑動操作。

# AdbSwipe.Title
source: AdbSwipe
zh_hans_cn: 滑动
zh_tw: 滑動

# AdbInput.Description
source: Send text input to android device, this action only support ASCII characters.
zh_hans_cn: 在安卓模拟器中模拟输入文本，此动作仅支持英文输入。
zh_tw: 在安卓模擬器中模擬輸入文本，此動作僅支持英文輸入。

# AdbInput.Title
source: AdbInput
zh_hans_cn: 键盘输入 * 英文
zh_tw: 键盘輸入 *英文

# AdbKey.Description
source: Simulate the keys in an android simulator.
ja_jp: Androidエミュレータでキーをエミュレートします。
zh_hans_cn: 在安卓模拟器中模拟按键。
zh_tw: 在安卓模擬器中類比按鍵。

# AdbKey.Title
source: Key
ja_jp: キー
zh_hans_cn: 按键
zh_tw: 按鍵

# AdbTap.Description
source: Simulate clicks in an android simulator.
ja_jp: Androidエミュレータでクリックをシミュレートします。
zh_hans_cn: 在安卓模拟器中模拟点击。
zh_tw: 在安卓模擬器中類比點擊。

# AdbTap.Title
source: Click
ja_jp: クリック
zh_hans_cn: 点击
zh_tw: 點擊

# AdbScreenCap.Description
source: Simulator screen capture.
ja_jp: エミュレータのスクリーンショット。
zh_hans_cn: 模拟器屏幕截图。
zh_tw: 模擬器螢幕截圖。

# AdbScreenCap.Title
source: Screenshot
ja_jp: スクリーンショット
zh_hans_cn: 截图
zh_tw: 截圖

# AccessArray.Description
source: Get the elements in the array from the index.
ja_jp: インデックスに基づいて配列の要素を取得します。
zh_hans_cn: 根据索引获取 数组 当中的元素。
zh_tw: 根據索引獲取數組當中的元素。

# AccessArray.Title
source: Access the array
ja_jp: 配列へのアクセス
zh_hans_cn: 访问数组
zh_tw: 訪問數組

# BaiduTranslate.Description
source: Online translation based on Baidu Cloud interface translates Chinese into English and other languages, as well as other languages into Chinese.
zh_hans_cn: 基于百度云接口的在线翻译，将中文翻译成英文和其他语言，以及其他语言翻译成中文。
zh_tw: 基於百度雲接口的在線翻譯，將中文翻譯成英文和其他語言，以及其他語言翻譯成中文。

# BaiduTranslate.Title
source: BaiduTranslate
zh_hans_cn: 百度翻译
zh_tw: 百度翻譯

# AdbStartApp.Description
source: This action opens the app on the android emulator.
ja_jp: この動作でandroidエミュレータ上のappを開くことができます。
zh_hans_cn: 该动作可以打开安卓模拟器上的 App。
zh_tw: 該動作可以打開安卓模擬器上的app。

# AdbStartApp.Title
source: Open the application
ja_jp: アプリケーションを開く
zh_hans_cn: 打开应用
zh_tw: 打開應用

# AccessKey.Description
source: Gets the value of the object by the specified name.
ja_jp: 指定した名前に基づいて、オブジェクトの値を取得します。
zh_hans_cn: 根据指定的名称，获取 对象 的值。
zh_tw: 根據指定的名稱，獲取對象的值。

# AccessKey.Title
source: AccessKey
zh_hans_cn: 访问对象
zh_tw: 訪問對象

# CaptureActiveWindow.Description
source: To only capture the active window you're working in.
zh_hans_cn: 截取当前活动窗口图像
zh_tw: 截取當前活動窗口圖像。

# CaptureActiveWindow.Title
source: CaptureActiveWindow
zh_hans_cn: 活动窗口截图
zh_tw: 活動窗口截圖

# Cloud.Description
source: Cloud
ja_jp: クラウド
zh_hans_cn: 云接口调用
zh_tw: 雲

# Cloud.Title
source: Cloud
ja_jp: クラウド
zh_hans_cn: 云
zh_tw: 雲接口調用

# Pandas.Description
source: Data analysis and manipulation tool
zh_hans_cn: 数据分析和操纵工具
zh_tw: 數據分析和操縱工具

# Pandas.Title
source: Pandas
zh_hans_cn: 数据分析
zh_tw: 數據分析

# LoadDocument.Description
source: Load the document
zh_hans_cn: 加载文档
zh_tw: 加載檔案

# LoadDocument.Title
source: LoadDocument
zh_hans_cn: 文档
zh_tw: 加载檔案

# DataFrameQuery.Description
source: Query the DataFrame
zh_hans_cn: 查询 DataFrame 数据结构
zh_tw: 查詢 DataFrame 數據結構

# DataFrameQuery.Title
source: DataFrameQuery
zh_hans_cn: 查询
zh_tw: 查詢

# NameLoc.Description
source: Used to select rows and columns by names/labels of pandas DataFrame.
zh_hans_cn: 用于通过标签选择/过滤行和列。
zh_tw: 用於通過標籤選擇/過濾行和列。

# NameLoc.Title
source: NameLoc
zh_hans_cn: 行列选择（标签）
zh_tw: 行列選擇（标签）

# FilterText.Description
source: In the array or list, the filter contains the specified text elements.
ja_jp: 配列またはリストでは、フィルタには指定されたテキストエレメントが含まれます。
zh_hans_cn: 在数组或者列表中，筛选包含指定文本元素。
zh_tw: 在數組或者清單中，篩選包含指定文字元素。

# FilterText.Title
source: Text screening
ja_jp: テキストフィルタ
zh_hans_cn: 文本筛选
zh_tw: 文字篩選

# RowsCount.Description
source: Return an int representing the number of elements in object.
zh_hans_cn: 获取数据的行数
zh_tw: 獲取數據的行數

# RowsCount.Title
source: RowsCount
zh_hans_cn: 统计行数
zh_tw: 統計行數

# OutputString.Description
source: Output String
zh_hans_cn: 输出字符串
zh_tw: 輸出字符串

# OutputString.Title
source: OutputString
zh_hans_cn: 输出字符串
zh_tw: 輸出字符串

# SaveDocument.Description
source: Save the document
zh_hans_cn: 保存文件
zh_tw: 保存檔案

# SaveDocument.Title
source: SaveDocument
zh_hans_cn: 保存文件
zh_tw: 保存檔案

# IsEmpty.Description
source: Determine whether the container or the list is empty
ja_jp: コンテナまたはリストが空かどうかを判断します
zh_hans_cn: 判断 容器 或者 列表 是否为空
zh_tw: 判斷容器或者清單是否為空

# IsEmpty.Title
source: The empty
ja_jp: 空を判定する
zh_hans_cn: 判空
zh_tw: 判空

# QRCode.Description
source: Identify the qr code in the picture.
ja_jp: 画像中の二次元コードを認識する。
zh_hans_cn: 识别图片中的二维码。
zh_tw: 識別圖片中的二維碼。

# QRCode.Title
source: Qr code identification
ja_jp: 二次元コード認識
zh_hans_cn: 二维码识别
zh_tw: 二維碼識別

# Param.Description
source: It is used to obtain data from the parent action.
zh_hans_cn: 通常做为子动作，其值由相应的父动作传入。例如列表中的每个项都会被透传给该动作。
zh_tw: 通常做為子動作，其值由對應的父動作傳入。 例如清單中的每個項目都會被透傳給該動作。

# Param.Title
source: Param
zh_hans_cn: 参数
zh_tw: 参数

# CellClick.Description
source: Move the mouse to grid cell and click the mouse
zh_hans_cn: 移动鼠标至网格中的每个单元格并点击鼠标
zh_tw: 移動鼠標至網格中的每個單元格並點擊鼠標

# CellClick.Title
source: CellClick
zh_hans_cn: 点击 * 网格
zh_tw: 點擊 * 網格

# WebElementSendKey.Description
source: Send the button
ja_jp: 送信キー
zh_hans_cn: 发送按键
zh_tw: 發送按鍵

# WebElementSendKey.Title
source: Send the button
ja_jp: 送信キー
zh_hans_cn: 发送按键
zh_tw: 發送按鍵

# WebElementClick.Description
source: Click
ja_jp: クリック
zh_hans_cn: 模拟鼠标左键点击元素。
zh_tw: 模擬鼠標左鍵點擊元素。

# WebElementClick.Title
source: Click
ja_jp: クリック
zh_hans_cn: 点击
zh_tw: 點擊

# WebElementClear.Description
source: If the text is a text input element, clear the text.
ja_jp: テキストがテキスト入力エレメントの場合は、テキストを消去します。
zh_hans_cn: 如果文本是文本输入元素，则清除文本。
zh_tw: 如果文字是文字輸入元素，則清除文字。

# WebElementClear.Title
source: Clear the text
ja_jp: テキストをクリア
zh_hans_cn: 清除文本
zh_tw: 清除文字

# WebElementSendText.Description
source: Send text to web elements that currently have a focus.
ja_jp: 現在フォーカスがあるwebエレメントにテキストを送信します。
zh_hans_cn: 向当前有焦点的 Web 元素发送文本。
zh_tw: 向當前有焦點的web元素發送文字。

# WebElementSendText.Title
source: Send text
ja_jp: テキストの送信
zh_hans_cn: 设置文本
zh_tw: 設置文字

# WebActionClickHold.Description
source: Hold down the left mouse button on the element, which needs to be added to the action chain.
ja_jp: エレメント上でマウスの左ボタンを押したままにすると、このアクションはアクションチェーンに追加されます。
zh_hans_cn: 在元素上按住鼠标左键, 此动作需要加入到动作链当中。
zh_tw: 在元素上按住滑鼠左鍵，此動作需要加入到動作鏈當中。

# WebActionClickHold.Title
source: Action chain. point press
ja_jp: アクションチェーン点押し
zh_hans_cn: 动作链.点按
zh_tw: 動作鏈.點按

# WebActionDoubleClick.Description
source: Double-click on an element, and this action needs to be added to the action chain.
ja_jp: 要素をダブルクリックすると、そのアクションはアクションチェーンに追加されます。
zh_hans_cn: 双击一个元素, 此动作需要加入到动作链当中。
zh_tw: 按兩下一個元素，此動作需要加入到動作鏈當中。

# WebActionDoubleClick.Title
source: Action chain. double click
ja_jp: アクションチェーン、ダブルクリック
zh_hans_cn: 动作链.双击
zh_tw: 動作鏈.按兩下

# WebActionMoveTo.Description
source: Move the mouse over to the element.
ja_jp: 要素の上にマウスを移動します。
zh_hans_cn: 将鼠标移动到元素上。
zh_tw: 將滑鼠移動到元素上。

# WebActionMoveTo.Title
source: Action chain. shift
ja_jp: アクションチェーン
zh_hans_cn: 动作链.移动
zh_tw: 動作鏈.移動

# WebActionRelease.Description
source: Release the pressed mouse button on the element.
ja_jp: エレメントの上にあるマウスボタンを放します。
zh_hans_cn: 释放元素上按住的鼠标按钮。
zh_tw: 釋放元素上按住的滑鼠按鈕。

# WebActionRelease.Title
source: Action chain. release
ja_jp: アクションチェーン
zh_hans_cn: 动作链.释放
zh_tw: 動作鏈.釋放

# WebActionDragDrop.Description
source: Press and hold the left mouse button on the source element, then move to the target element and release the mouse.
ja_jp: ソース要素上でマウスの左ボタンを押したまま、ターゲット要素に移動してマウスを放します。
zh_hans_cn: 在源元素上按住鼠标左键，然后移动到目标元素并释放鼠标。
zh_tw: 在源元素上按住滑鼠左鍵，然後移動到目標元素並釋放滑鼠。

# WebActionDragDrop.Title
source: Action chain. drag and drop
ja_jp: アクションチェーン：ドラッグ&ドロップ
zh_hans_cn: 动作链.拖放
zh_tw: 動作鏈.拖放

# WebActionKeyDown.Description
source: Send the keys only, and do not release them. use it only with (control, alt, and shift).
ja_jp: キーを送信するだけで、解除しません。(control、alt、shift)でのみ使用できます。
zh_hans_cn: 仅发送按键，不释放。只能使用（Control、Alt 和 Shift）修饰键。
zh_tw: 僅發送按鍵，不釋放。只能使用（Control、Alt 和 Shift）修飾鍵。

# WebActionKeyDown.Title
source: Action chain. key
ja_jp: アクションチェーン
zh_hans_cn: 动作链.按下修饰键
zh_tw: 動作鏈.按下修饰键

# WebActionKeyUp.Description
source: Release the modification key
ja_jp: 変更キーの解除
zh_hans_cn: 释放修饰键
zh_tw: 释放修饰键

# WebActionKeyUp.Title
source: Action chain. release the key button
ja_jp: アクションチェーン.キーを離す
zh_hans_cn: 动作链.释放修饰键
zh_tw: 動作鏈.释放修饰键

# WebActionMoveOffset.Description
source: Move the mouse to the current mouse location or specify the offset of the web element.
ja_jp: 現在のマウス位置にマウスを移動するか、webエレメントのオフセットを指定します。
zh_hans_cn: 将鼠标移动到当前鼠标位置的或指定 Web 元素的偏移量。
zh_tw: 將滑鼠移動到當前滑鼠位置的或指定web元素的偏移量。

# WebActionMoveOffset.Title
source: WebActionMoveOffset
zh_hans_cn: 动作链.偏移移动
zh_tw: 動作鏈.偏移移動

# WebActionSendText.Description
source: Set the text
ja_jp: テキストの設定
zh_hans_cn: 设置文本
zh_tw: 設定文字

# WebActionSendText.Title
source: Action chain. send out the text
ja_jp: アクションチェーン：テキストの送信
zh_hans_cn: 动作链.发送文本
zh_tw: 動作鏈.發送文字

# LoggingControl.Description
source: This action is used to control the output logs in the process
zh_hans_cn: 该动作用来在流程中控制输出日志
zh_tw: 該動作用來在流程中控制輸出日誌

# LoggingControl.Title
source: Outgoing control
zh_hans_cn: 输出控制
zh_tw: 輸出控制

# AdaptiveThreshold.Description
source: The adaptive thresholds are calculated for smaller regions, and so there are different thresholds for different regions.
ja_jp: [適応しきい値]は、小さい領域に対してしきい値を計算するため、領域ごとにしきい値が異なります。
zh_hans_cn: 自适应阈值是针对较小的区域计算阈值，因此对于不同的区域会有不同的阈值。
zh_tw: 自我調整閾值是針對較小的區域計算閾值，囙此對於不同的區域會有不同的閾值。

# AdaptiveThreshold.Title
source: AdaptiveThreshold
zh_hans_cn: 自适应阈值
zh_tw: 自我調整閾值

# GroupAction.Description
source: This action groups the relevant actions on the view to make the logic clearer.
ja_jp: このアクションは、ビュー上の関連するアクションをグループ化し、論理をより明確にすることができます。
zh_hans_cn: 该动作可以把视图上相关动作分组，使逻辑更清晰。
zh_tw: 該動作可以把視圖上相關動作分組，使邏輯更清晰。

# GroupAction.Title
source: Divide into groups
ja_jp: グループ分け
zh_hans_cn: 分组
zh_tw: 分組

# AdbMove.Description
source: Move up and down, left and right, similar to the wasd feature in a game.
ja_jp: 上下左右に移動する、ゲームにおけるwasdのような機能。
zh_hans_cn: 上下左右移动，类似游戏当中的 WASD 功能。
zh_tw: 上下左右移動，類似遊戲當中的wasd功能。

# AdbMove.Title
source: Shift
ja_jp: 移動
zh_hans_cn: 移动
zh_tw: 移動

# NetworkListen.Description
source: Create a network service.
zh_hans_cn: 创建一个网络服务端。
zh_tw: 創建一個網絡服務端。

# NetworkListen.Title
source: NetworkListen
zh_hans_cn: 网络服务
zh_tw: 網絡服務

# NetworkSend.Description
source: Send data through the network.
zh_hans_cn: 通过网络，发送数据。
zh_tw: 通過網絡，發送數據。

# NetworkSend.Title
source: NetworkSend
zh_hans_cn: 发送数据
zh_tw: 數據發送

# NetworkReceive.Description
source: Receive network data.
zh_hans_cn: 接收网络数据。
zh_tw: 接收網絡數據。

# NetworkReceive.Title
source: NetworkReceive
zh_hans_cn: 接收数据
zh_tw: 數據接收

# NetworkConnect.Description
source: Connect to the network server.
zh_hans_cn: 连接网络服务端。
zh_tw: 連接網絡服務端。

# NetworkConnect.Title
source: NetworkConnect
zh_hans_cn: 连接服务
zh_tw: 服務連接

# FilterArea.Description
source: Filter the elements in the list by calculating the area of the elements in the array
ja_jp: 配列内の要素の面積を計算してリスト内の要素をフィルタする
zh_hans_cn: 通过计算数组中元素的面积来筛选列表中的元素
zh_tw: 通過計算數組中元素的面積來篩選清單中的元素

# FilterArea.Title
source: Area screening
ja_jp: めんせきふるいわけ
zh_hans_cn: 面积筛选
zh_tw: 面積篩選

# FilterPerimeter.Description
source: Calculate the circumference of the elements in the array and filter the eligible elements
ja_jp: 配列内の要素の周囲を計算し、条件を満たす要素をフィルタする
zh_hans_cn: 计算数组中元素的周长，筛选符合条件的元素
zh_tw: 計算數組中元素的周長，篩選符合條件的元素

# FilterPerimeter.Title
source: Peripheral screening
ja_jp: 周長フィルタリング
zh_hans_cn: 周长筛选
zh_tw: 周長篩選

# ColorPercentage.Description
source: This action can count the percentage of a color in the image
ja_jp: このアクションは、画像内のカラーの割合をカウントします
zh_hans_cn: 此动作可以统计某一颜色在图像当中所占的比例
zh_tw: 此動作可以統計某一顏色在影像當中所占的比例

# ColorPercentage.Title
source: ColorPercentage
ja_jp: カラー統計(color statistics)
zh_hans_cn: 颜色统计
zh_tw: 顏色統計
